CSI API ETABS v1
cPointObj.GetSpringAssignment Method
 Retrieves the named point spring property assignment for a point object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSpringAssignment(
	string Name,
	ref string SpringProp
)
Function GetSpringAssignment (
	Name As String,
	ByRef SpringProp As String
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim SpringProp As String
Dim returnValue As Integer
returnValue = instance.GetSpringAssignment(Name,
	SpringProp)
int GetSpringAssignment(
	String^ Name,
	String^% SpringProp
)
abstract GetSpringAssignment :
        Name : string *
        SpringProp : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing point object
SpringProp
Type: System.String
 The name of an existing point spring property
Return Value
Type: Int32
 Returns zero if the assignment is successfully retrieved, otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim SpringProp As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
   ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new spring property
   Dim k() as Double
   ReDim k(5)
   k(2) = 1
   ret = SapModel.PropPointSpring.SetPointSpringProp("mySpringProp1", 1, k)
'assign property
   ret = SapModel.PointObj.SetSpringAssignment("1", "mySpringProp1")
'get assigned property
   Dim prop as String
   ret = SapModel.PointObj.GetSpringAssignment("1", prop)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPointObj Interface
ETABSv1 Namespace